Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ2064DAS169.PIC
      <edc:SFRDef edc:_addr="0x1F84B100" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="27" edc:access="----nnnnn--nnnnnr--rrrrrn--nnnnn" edc:cname="ADCANCON" edc:desc="" edc:impl="0xf9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----00000--000000--000000--00000" edc:name="ADCANCON" edc:nzwidth="32" edc:por="----00000--000000--000000--00000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANEN0" edc:mask="0x1" edc:name="ANEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN1" edc:mask="0x1" edc:name="ANEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN2" edc:mask="0x1" edc:name="ANEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN3" edc:mask="0x1" edc:name="ANEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN4" edc:mask="0x1" edc:name="ANEN4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANEN7" edc:mask="0x1" edc:name="ANEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY0" edc:mask="0x1" edc:name="WKRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY1" edc:mask="0x1" edc:name="WKRDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY2" edc:mask="0x1" edc:name="WKRDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY3" edc:mask="0x1" edc:name="WKRDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY4" edc:mask="0x1" edc:name="WKRDY4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="WKRDY7" edc:mask="0x1" edc:name="WKRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN0" edc:mask="0x1" edc:name="WKIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN1" edc:mask="0x1" edc:name="WKIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN2" edc:mask="0x1" edc:name="WKIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN3" edc:mask="0x1" edc:name="WKIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN4" edc:mask="0x1" edc:name="WKIEN4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="WKIEN7" edc:mask="0x1" edc:name="WKIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPCLKCNT" edc:mask="0xf" edc:name="WKUPCLKCNT" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F84B104" edc:offset="0x4fc"/>
      <edc:SFRDef edc:_addr="0x1F84B600" edc:_begin="0xa0" edc:_end="0xb4" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="28" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC0CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC0CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B604" edc:_begin="0xa0" edc:_end="0xb4" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="28" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="ADC1CFG" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0000000000000" edc:name="ADC1CFG" edc:nzwidth="32" edc:por="-------------------0000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0x1fff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B608" edc:_begin="0xa0" edc:_end="0xb4" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="28" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC2CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC2CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B60C" edc:_begin="0xa0" edc:_end="0xb4" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="28" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC3CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC3CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B610" edc:_begin="0xa0" edc:_end="0xb4" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="28" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC4CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC4CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F84B614" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x1F84B61C" edc:_begin="0xbc" edc:_end="0xc0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="29" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC7CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC7CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
